In [1]:
DATASET_PATH = '../dataset/egypt_real_estate_listings.csv'
CLEANED_DATASET_PATH = '../dataset/egypt_real_estate_listings_cleaned.csv'

In [2]:
import pandas as pd
import numpy as np
import re

In [3]:
df = pd.read_csv(DATASET_PATH)

In [4]:
df.head()

,url,price,description,location,type,size,bedrooms,bathrooms,available_from,payment_method,down_payment
0,https://www.propertyfinder.eg/en/plp/buy/chale...,"8,000,000",OWN A CHALET IN EL GOUNA WITH A PRIME LOCATION...,"Swan Lake Gouna, Al Gouna, Hurghada, Red Sea",Chalet,732 sqft / 68 sqm,1+ Maid,1,31 Aug 2025,Cash,"1,200,000 EGP"
1,https://www.propertyfinder.eg/en/plp/buy/villa...,"25,000,000","For sale, a villa with immediate delivery in C...","Karmell, New Zayed City, Sheikh Zayed City, Giza",Villa,"2,368 sqft / 220 sqm",4,4,2 Sep 2025,Cash,"2,100,000 EGP"
2,https://www.propertyfinder.eg/en/plp/buy/chale...,"15,135,000","With a down payment of EGP 1,513,000, a fully ...","Azha North, Ras Al Hekma, North Coast",Chalet,"1,270 sqft / 118 sqm",2,2,19 Aug 2025,Cash,"1,513,000 EGP"
3,https://www.propertyfinder.eg/en/plp/buy/apart...,"12,652,000",Own an apartment in New Cairo with a minimal d...,"Taj City, 5th Settlement Compounds, The 5th Se...",Apartment,"1,787 sqft / 166 sqm",3,2,26 Aug 2025,Installments,"1,260,000 EGP"
4,https://www.propertyfinder.eg/en/plp/buy/villa...,"45,250,000",Project: Granville\nLocation: Fifth Settlement...,"Granville, New Capital City, Cairo",Villa,"4,306 sqft / 400 sqm",7,7,2 Sep 2025,Cash,"2,262,500 EGP"

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19924 entries, 0 to 19923
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   url             19924 non-null  object
 1   price           19385 non-null  object
 2   description     19846 non-null  object
 3   location        19833 non-null  object
 4   type            19847 non-null  object
 5   size            19847 non-null  object
 6   bedrooms        19780 non-null  object
 7   bathrooms       19784 non-null  object
 8   available_from  19261 non-null  object
 9   payment_method  19383 non-null  object
 10  down_payment    5445 non-null   object
dtypes: object(11)
memory usage: 1.7+ MB

In [6]:
df.columns.to_list()

['url',
 'price',
 'description',
 'location',
 'type',
 'size',
 'bedrooms',
 'bathrooms',
 'available_from',
 'payment_method',
 'down_payment']

In [7]:
df= df[[
 'price',
 'location',
 'type',
 'size',
 'bedrooms',
 'bathrooms',
 'available_from',
 'payment_method']]

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19924 entries, 0 to 19923
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   price           19385 non-null  object
 1   location        19833 non-null  object
 2   type            19847 non-null  object
 3   size            19847 non-null  object
 4   bedrooms        19780 non-null  object
 5   bathrooms       19784 non-null  object
 6   available_from  19261 non-null  object
 7   payment_method  19383 non-null  object
dtypes: object(8)
memory usage: 1.2+ MB

In [9]:
print(f"duplicated rows: {df.duplicated().sum()}")

duplicated rows: 326

In [10]:
df.drop_duplicates(inplace=True)

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 19598 entries, 0 to 19923
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   price           19142 non-null  object
 1   location        19584 non-null  object
 2   type            19597 non-null  object
 3   size            19597 non-null  object
 4   bedrooms        19544 non-null  object
 5   bathrooms       19548 non-null  object
 6   available_from  19017 non-null  object
 7   payment_method  19140 non-null  object
dtypes: object(8)
memory usage: 1.3+ MB

In [12]:
print(f"null values: \n{df.isnull().sum()}")

null values:
price             456
location           14
type                1
size                1
bedrooms           54
bathrooms          50
available_from    581
payment_method    458
dtype: int64

In [13]:
df.dropna(inplace=True)

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 18549 entries, 0 to 19923
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   price           18549 non-null  object
 1   location        18549 non-null  object
 2   type            18549 non-null  object
 3   size            18549 non-null  object
 4   bedrooms        18549 non-null  object
 5   bathrooms       18549 non-null  object
 6   available_from  18549 non-null  object
 7   payment_method  18549 non-null  object
dtypes: object(8)
memory usage: 1.3+ MB

In [15]:
df.head()

,price,location,type,size,bedrooms,bathrooms,available_from,payment_method
0,"8,000,000","Swan Lake Gouna, Al Gouna, Hurghada, Red Sea",Chalet,732 sqft / 68 sqm,1+ Maid,1,31 Aug 2025,Cash
1,"25,000,000","Karmell, New Zayed City, Sheikh Zayed City, Giza",Villa,"2,368 sqft / 220 sqm",4,4,2 Sep 2025,Cash
2,"15,135,000","Azha North, Ras Al Hekma, North Coast",Chalet,"1,270 sqft / 118 sqm",2,2,19 Aug 2025,Cash
3,"12,652,000","Taj City, 5th Settlement Compounds, The 5th Se...",Apartment,"1,787 sqft / 166 sqm",3,2,26 Aug 2025,Installments
4,"45,250,000","Granville, New Capital City, Cairo",Villa,"4,306 sqft / 400 sqm",7,7,2 Sep 2025,Cash

In [16]:
#convert price to float
df['price'] = df['price'].replace(',', '', regex=True).astype(float)
df.info()
df.head()

<class 'pandas.core.frame.DataFrame'>
Index: 18549 entries, 0 to 19923
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   price           18549 non-null  float64
 1   location        18549 non-null  object
 2   type            18549 non-null  object
 3   size            18549 non-null  object
 4   bedrooms        18549 non-null  object
 5   bathrooms       18549 non-null  object
 6   available_from  18549 non-null  object
 7   payment_method  18549 non-null  object
dtypes: float64(1), object(7)
memory usage: 1.3+ MB

,price,location,type,size,bedrooms,bathrooms,available_from,payment_method
0,8000000.0,"Swan Lake Gouna, Al Gouna, Hurghada, Red Sea",Chalet,732 sqft / 68 sqm,1+ Maid,1,31 Aug 2025,Cash
1,25000000.0,"Karmell, New Zayed City, Sheikh Zayed City, Giza",Villa,"2,368 sqft / 220 sqm",4,4,2 Sep 2025,Cash
2,15135000.0,"Azha North, Ras Al Hekma, North Coast",Chalet,"1,270 sqft / 118 sqm",2,2,19 Aug 2025,Cash
3,12652000.0,"Taj City, 5th Settlement Compounds, The 5th Se...",Apartment,"1,787 sqft / 166 sqm",3,2,26 Aug 2025,Installments
4,45250000.0,"Granville, New Capital City, Cairo",Villa,"4,306 sqft / 400 sqm",7,7,2 Sep 2025,Cash

In [17]:
df["location"].value_counts()

location
Marassi, Sidi Abdel Rahman, North Coast                                                      396
Mountain View iCity, 5th Settlement Compounds, The 5th Settlement, New Cairo City, Cairo     371
Madinaty, Cairo                                                                              347
Hyde Park, 5th Settlement Compounds, The 5th Settlement, New Cairo City, Cairo               342
Palm Hills New Cairo, 5th Settlement Compounds, The 5th Settlement, New Cairo City, Cairo    306
                                                                                            ...
Nazih Khalifa St., El Korba, Heliopolis - Masr El Gedida, Cairo                                1
Kasr Al Safa St., Zezenia, Hay Sharq, Alexandria                                               1
VAHA by Alkarma Developments, New Zayed City, Sheikh Zayed City, Giza                          1
First Heights, 26th of July Corridor, 6 October City, Giza                                     1
Geziret Al Arab St. (El Mohandes Mohamed Hassan Helmy), Mohandessin, Giza                      1
Name: count, Length: 1485, dtype: int64

In [18]:
df['location'] = df['location'].str.strip().str.title()

In [19]:
df['governorate'] = df['location'].str.split(',').str[-1].str.strip()

In [20]:
df['city'] = df['location'].str.split(',').str[-2].str.strip()

In [21]:
df['district'] = df['location'].str.split(',').str[-3].str.strip()

In [22]:
df['compound'] = df['location'].str.split(',').str[0].str.strip()

In [23]:
def split_location(df):
    # Clean and standardize the text
    df['location'] = df['location'].astype(str).str.strip().str.title()
    
    # Split into parts
    df['location_parts'] = df['location'].str.split(',')
    
    # Extract components safely
    df['compound'] = df['location_parts'].apply(lambda x: x[0].strip() if len(x) >= 1 else None)
    df['governorate'] = df['location_parts'].apply(lambda x: x[-1].strip() if len(x) >= 1 else None)
    df['city'] = df['location_parts'].apply(lambda x: x[-2].strip() if len(x) >= 2 else None)
    df['district'] = df['location_parts'].apply(lambda x: x[-3].strip() if len(x) >= 3 else df['city'])
    
    # Drop helper column
    df = df.drop(columns=['location_parts', 'location'])
    return df

# Apply function
df = split_location(df)

In [24]:
df[["governorate", "city", "district", "compound"]].isnull().sum()

governorate    0
city           0
district       0
compound       0
dtype: int64

In [25]:
df.head()

,price,type,size,bedrooms,bathrooms,available_from,payment_method,governorate,city,district,compound
0,8000000.0,Chalet,732 sqft / 68 sqm,1+ Maid,1,31 Aug 2025,Cash,Red Sea,Hurghada,Al Gouna,Swan Lake Gouna
1,25000000.0,Villa,"2,368 sqft / 220 sqm",4,4,2 Sep 2025,Cash,Giza,Sheikh Zayed City,New Zayed City,Karmell
2,15135000.0,Chalet,"1,270 sqft / 118 sqm",2,2,19 Aug 2025,Cash,North Coast,Ras Al Hekma,Azha North,Azha North
3,12652000.0,Apartment,"1,787 sqft / 166 sqm",3,2,26 Aug 2025,Installments,Cairo,New Cairo City,The 5Th Settlement,Taj City
4,45250000.0,Villa,"4,306 sqft / 400 sqm",7,7,2 Sep 2025,Cash,Cairo,New Capital City,Granville,Granville

In [26]:
df["type"] = df["type"].astype(str)

In [27]:
print(df.dtypes)

price             float64
type               object
size               object
bedrooms           object
bathrooms          object
available_from     object
payment_method     object
governorate        object
city               object
district           object
compound           object
dtype: object

In [28]:
def convert_size_to_sqm(size_str):
    if not isinstance(size_str, str):
        return None

    size_str = size_str.lower().strip()
    
    # Case 1: pattern like "732 sqft / 68 sqm"
    match = re.search(r"(\d+\.?\d*)\s*sqft\s*/\s*(\d+\.?\d*)\s*sqm", size_str)
    if match:
        # Prefer sqm since both are given
        return float(match.group(2))
    
    # Case 2: only sqft
    match = re.search(r"(\d+\.?\d*)\s*sqft", size_str)
    if match:
        sqft = float(match.group(1))
        return round(sqft * 0.092903, 2)  # convert sqft → sqm
    
    # Case 3: only sqm
    match = re.search(r"(\d+\.?\d*)\s*sqm", size_str)
    if match:
        return float(match.group(1))
    
    return None  # if pattern not recognized

# Example usage:
df["size_sqm"] = df["size"].apply(convert_size_to_sqm).astype(float)
df.drop(columns=["size"], inplace=True)

In [29]:
df["size_sqm"].isnull().sum()

np.int64(0)

In [30]:
df["type"].value_counts()

type
Apartment          7958
Chalet             3781
Villa              3242
Townhouse          1230
Twin House          777
Duplex              583
Penthouse           546
iVilla              250
Hotel Apartment     101
Cabin                35
Palace               23
Whole Building       14
Roof                  5
Full Floor            4
Name: count, dtype: int64

In [31]:
df["bedrooms"].value_counts()

bedrooms
3               4737
3+ Maid         3503
2               2720
4+ Maid         1952
2+ Maid         1644
4               1053
1                719
5+ Maid          669
1+ Maid          431
5                287
studio           267
6+ Maid          219
7+ Maid          111
6                 82
7++ Maid          53
studio+ Maid      48
7                 32
7+                22
Name: count, dtype: int64

In [32]:
def parse_bedrooms(value):
    value = str(value).strip().lower()

    # Detect maid room
    has_maid = "maid" in value

    # Handle studio
    if "studio" in value:
        return 0, has_maid  # Treat studio as 0 bedrooms

    # Extract first number
    match = re.search(r"\d+", value)
    if match:
        bedrooms = int(match.group())
    else:
        bedrooms = None

    return bedrooms, has_maid

# Apply function
df[["bedrooms_num", "has_maid_room"]] = df["bedrooms"].apply(lambda x: pd.Series(parse_bedrooms(x)))
df.drop(columns=["bedrooms"], inplace=True)

In [33]:
print(df.dtypes)

price             float64
type               object
bathrooms          object
available_from     object
payment_method     object
governorate        object
city               object
district           object
compound           object
size_sqm          float64
bedrooms_num        int64
has_maid_room        bool
dtype: object

In [34]:
df['bathrooms'].value_counts()

bathrooms
3       6170
2       5247
4       3035
1       2002
5       1194
6        407
7        202
7+       138
3.0       48
2.0       46
1.0       21
4.0       18
5.0       11
none       5
6.0        3
7.0        2
Name: count, dtype: int64

In [35]:
def parse_bathrooms(value):
    value = str(value).strip().lower()

    # Handle missing or invalid
    if value in ["none", "nan", ""]:
        return 0

    # Extract the first integer (e.g., from "7+", "3.0", etc.)
    match = re.search(r"\d+", value)
    if match:
        return int(match.group())

    return np.nan

# Apply cleaning
df["bathrooms_num"] = df["bathrooms"].apply(parse_bathrooms)
df.drop(columns=["bathrooms"], inplace=True)

In [36]:
df.head()

,price,type,available_from,payment_method,governorate,city,district,compound,size_sqm,bedrooms_num,has_maid_room,bathrooms_num
0,8000000.0,Chalet,31 Aug 2025,Cash,Red Sea,Hurghada,Al Gouna,Swan Lake Gouna,68.0,1,True,1
1,25000000.0,Villa,2 Sep 2025,Cash,Giza,Sheikh Zayed City,New Zayed City,Karmell,220.0,4,False,4
2,15135000.0,Chalet,19 Aug 2025,Cash,North Coast,Ras Al Hekma,Azha North,Azha North,118.0,2,False,2
3,12652000.0,Apartment,26 Aug 2025,Installments,Cairo,New Cairo City,The 5Th Settlement,Taj City,166.0,3,False,2
4,45250000.0,Villa,2 Sep 2025,Cash,Cairo,New Capital City,Granville,Granville,400.0,7,False,7

In [37]:
df['available_from'] = pd.to_datetime(df['available_from'], errors='coerce')

In [38]:
df.sort_values(by='available_from', inplace=True)

In [39]:
df.head()

,price,type,available_from,payment_method,governorate,city,district,compound,size_sqm,bedrooms_num,has_maid_room,bathrooms_num
11719,12200000.0,Apartment,2023-06-14,Cash,North Coast,Al Alamein,New Alamein City,North Edge Towers,114.0,2,False,1
14757,7000000.0,Apartment,2023-07-18,Cash,Cairo,Heliopolis - Masr El Gedida,Almazah,Almazah,135.0,3,False,2
9513,12000000.0,Twin House,2023-08-03,Cash,Cairo,New Cairo City,The 5Th Settlement,Layan Residence,266.0,3,True,4
17781,11000000.0,Apartment,2023-09-20,Cash,Cairo,New Cairo City,El Katameya,District 5 Residences,154.0,2,False,3
11496,18500000.0,iVilla,2023-12-24,Cash,Cairo,New Cairo City,The 5Th Settlement,Mountain View Hyde Park,305.0,3,True,3

In [40]:
df.isnull().sum()

price             0
type              0
available_from    0
payment_method    0
governorate       0
city              0
district          0
compound          0
size_sqm          0
bedrooms_num      0
has_maid_room     0
bathrooms_num     0
dtype: int64

In [41]:
df.dtypes

price                    float64
type                      object
available_from    datetime64[ns]
payment_method            object
governorate               object
city                      object
district                  object
compound                  object
size_sqm                 float64
bedrooms_num               int64
has_maid_room               bool
bathrooms_num              int64
dtype: object

In [42]:
df.tail()

,price,type,available_from,payment_method,governorate,city,district,compound,size_sqm,bedrooms_num,has_maid_room,bathrooms_num
2205,4018350.0,Apartment,2026-09-02,Cash,Red Sea,Hurghada,El Hadaba District,El Hadaba District,86.0,3,False,1
7223,3505500.0,Apartment,2026-09-02,Cash,Red Sea,Hurghada,Hurghada Resorts,Magawish Resort,81.0,2,False,1
2203,13400000.0,Chalet,2026-09-02,Cash,North Coast,Ras Al Hekma,Koun,Koun,121.0,3,True,3
7099,4100000.0,Apartment,2026-09-02,Cash,Giza,6 October City,Hadayek October,Zat,128.0,3,False,3
414,5000000.0,Apartment,2027-10-31,Cash,Giza,6 October City,26Th Of July Corridor,Al Thawra El Khadra,90.0,2,False,1

In [49]:
df.loc[df.shape[0]].to_dict()

{'price': 3200000.0,
 'type': 'Apartment',
 'available_from': Timestamp('2025-08-19 00:00:00'),
 'payment_method': 'Cash',
 'governorate': 'Cairo',
 'city': 'Nasr City',
 'district': 'Nasr City Compounds',
 'compound': 'Capital East',
 'size_sqm': 126.0,
 'bedrooms_num': 3,
 'has_maid_room': True,
 'bathrooms_num': 3}

In [43]:
df.shape

(18549, 12)

In [44]:
df.to_csv(CLEANED_DATASET_PATH, index=False)